[
  {
    "id": 1,
    "Title": "Fake It Till You Bake It",
    "Author": "Jamie Wesley",
    "PublicationDate": "June 21, 2022",
    "Genre": "Romance",
    "Description": "A reality star and a cupcake-baking football player pretend to be a couple in order to save his bakery in this sweet and sexy romance from Jamie Wesley, Fake It Till You Bake It.\n\nJada Townsend-Matthews is the most reviled woman in America after turning down a proposal on a reality dating show. When she comes home to lick her wounds, Jada finds herself working at San Diego's newest cupcake bakery, Sugar Blitz, alongside the uptight owner and professional football player Donovan Dell.\nWhen a reporter mistakenly believes Jada and Donovan are an item, they realize they can use the misunderstanding to their advantage to help the struggling bakery and rehabilitate Jada's image. Faking a relationship should be simple, but sometimes love is the most unexpected ingredient.\nFake it Till You Bake It is a sweet confection of a novel, the perfect story to curl up with and enjoy with a cupcake on the side.",
    "img": "Fake It Till You Bake It.webp"
  },
  {
    "id": 2,
    "Title": "A PHO Love Story",
    "Author": "Loan Le",
    "PublicationDate": "February 09, 2021",
    "Genre": "Romance",
    "Description": "When Dimple Met Rishi meets Ugly Delicious in this funny, smart romantic comedy, in which two Vietnamese American teens fall in love and must navigate their newfound relationship amid their families' age-old feud about their competing, neighboring restaurants.\nIf Bao Nguyen had to describe himself, he'd say he was a rock. Steady and strong, but not particularly interesting. His grades are average, his social status unremarkable. He works at his parents' pho restaurant, and even there, he is his parents' fifth favorite employee. Not ideal.\nIf Linh Mai had to describe herself, she'd say she was a firecracker. Stable when unlit, but full of potential for joy and fire. She loves art and dreams pursuing a career in it. The only problem? Her parents rely on her in ways they're not willing to admit, including working practically full-time at her family's pho restaurant.\nFor years, the Mais and the Nguyens have been at odds, having owned competing, neighboring pho restaurants. Bao and Linh, who've avoided each other for most of their lives, both suspect that the feud stems from feelings much deeper than friendly competition.\nBut then a chance encounter brings Linh and Bao in the same vicinity despite their best efforts and sparks fly, leading them both to wonder what took so long for them to connect. But then, of course, they immediately remember.\nCan Linh and Bao find love in the midst of feuding families and complicated histories?",
    "img": "A PHO Love Story.webp"
  },
  {
    "id": 3,
    "Title": "For Butter or Worse: A ROM Com",
    "Author": "Erin La Rosa",
    "PublicationDate": "July 26, 2022",
    "Genre": "Romance",
    "Description": "A FEMINIST BOOK CLUB CHOICE AWARD WINNER!\n\n\"With great tension, simmering heat, and clever banter, FOR BUTTER OR WORSE is a mouthwateringly delicious enemies-to-lovers romance.\"--Helen Hoang, USA Today bestselling author of The Heart Principle\n\n\"[A] sparkling romance...witty and lighthearted, with plenty of tender moments to keep readers invested, this work gets the enemies-to-lovers trope right.\"--Publishers Weekly\n\nThey go together like water and oil...\n\nAll chef Nina Lyon wants is to make a name for herself in the culinary world and inspire young women everywhere to do the same. For too long, she's been held back and underestimated by the male-dominated sphere of professional kitchens, and she's had enough. Now, as co-host of the competitive reality TV series The Next Cooking Champ!, she finally has a real shot at being top tier in the foodie scene.\nToo bad her co-host happens to be Hollywood's smarmiest jerk.\n\nRestaurateur Leo O'Donnell never means to get under Nina's skin. It just seems to happen, especially when the cameras are rolling. It's part of the anxiety and stress he has come to know all too well in this line of work. So nothing prepares him for the fallout after he takes one joke a smidge too far and Nina up and quits--on live TV.\n\nTo make matters worse, the two are caught in what looks like a compromising situation by the paparazzi...and fans of the show go absolutely nuts. Turns out, a \"secret romance\" between Nina and Leo may just be what their careers need most.\n\nNow all they have to do is play along, without killing each other...and without catching feelings. Easy as artisanal shepherd's pie. Right?",
    "img": "For Butter or Worse A ROM Com.webp"
  },
  {
    "id": 4,
    "Title": "Tweet Cute",
    "Author": "Emma Lord",
    "PublicationDate": "December 29, 2020",
    "Genre": "Romance",
    "Description": "Meet Pepper, swim team captain, chronic overachiever, and all-around perfectionist. Her family may be falling apart, but their massive fast-food chain is booming -- mainly thanks to Pepper, who is barely managing to juggle real life while secretly running Big League Burger's massive Twitter account.\nEnter Jack, class clown and constant thorn in Pepper's side. When he isn't trying to duck out of his obscenely popular twin's shadow, he's busy working in his family's deli. His relationship with the business that holds his future might be love/hate, but when Big League Burger steals his grandma's iconic grilled cheese recipe, he'll do whatever it takes to take them down, one tweet at a time.\nAll's fair in love and cheese -- that is, until Pepper and Jack's spat turns into a viral Twitter war. Little do they know, while they're publicly duking it out with snarky memes and retweet battles, they're also falling for each other in real life -- on an anonymous chat app Jack built.\nAs their relationship deepens and their online shenanigans escalate -- people on the internet are shipping them -- their battle gets more and more personal, until even these two rivals can't ignore they were destined for the most unexpected, awkward, all-the-feels romance that neither of them expected.",
    "img": "Tweet Cute.webp"
  },
  {
    "id": 5,
    "Title": "Meet Cute Diary",
    "Author": "Emery Lee",
    "PublicationDate": "April 12, 2022",
    "Genre": "Romance",
    "Description": "Felix Ever After meets Becky Albertalli in this swoon-worthy, heartfelt rom-com about how a transgender teen's first love challenges his ideas about perfect relationships.\n\n* A 2022 ALA Rainbow Booklist Selection * A Junior Library Guild Selection *\n\nNoah Ramirez thinks he's an expert on romance. He has to be for his popular blog, the Meet Cute Diary, a collection of trans happily ever afters. There's just one problem--all the stories are fake. What started as the fantasies of a trans boy afraid to step out of the closet has grown into a beacon of hope for trans readers across the globe.\n\nWhen a troll exposes the blog as fiction, Noah's world unravels. The only way to save the Diary is to convince everyone that the stories are true, but he doesn't have any proof. Then Drew walks into Noah's life, and the pieces fall into place: Drew is willing to fake-date Noah to save the Diary. But when Noah's feelings grow beyond their staged romance, he realizes that dating in real life isn't quite the same as finding love on the page.\n\nIn this charming novel by Emery Lee, Noah will have to choose between following his own rules for love or discovering that the most romantic endings are the ones that go off script.",
    "img": "Meet Cute Diary.webp"
  },
  {
    "id": 6,
    "Title": "Homegoing",
    "Author": "Yaa Gyasi",
    "PublicationDate": "May 02, 2017",
    "Genre": "Historical",
    "Description": "A NEW YORK TIMES NOTABLE BOOK - Ghana, eighteenth century: two half sisters are born into different villages, each unaware of the other. One will marry an Englishman and lead a life of comfort in the palatial rooms of the Cape Coast Castle. The other will be captured in a raid on her village, imprisoned in the very same castle, and sold into slavery.\n\nOne of Oprah's Best Books of the Year and a PEN/Hemingway award winner, Homegoing follows the parallel paths of these sisters and their descendants through eight generations: from the Gold Coast to the plantations of Mississippi, from the American Civil War to Jazz Age Harlem. Yaa Gyasi's extraordinary novel illuminates slavery's troubled legacy both for those who were taken and those who stayed--and shows how the memory of captivity has been inscribed on the soul of our nation.",
    "img": "Homegoing.webp"
  },
  {
    "id": 7,
    "Title": "The Poet X",
    "Author": "Elizabeth Acevedo",
    "PublicationDate": "April 07, 2020",
    "Genre": "Historical",
    "Description": "Winner of the National Book Award for Young People's Literature, the Michael L. Printz Award, and the Pura Belpré Award!\n\nFans of Jacqueline Woodson, Meg Medina, and Jason Reynolds will fall hard for this astonishing New York Times-bestselling novel-in-verse by an award-winning slam poet, about an Afro-Latina heroine who tells her story with blazing words and powerful truth.\n\nXiomara Batista feels unheard and unable to hide in her Harlem neighborhood. Ever since her body grew into curves, she has learned to let her fists and her fierceness do the talking.\n\nBut Xiomara has plenty she wants to say, and she pours all her frustration and passion onto the pages of a leather notebook, reciting the words to herself like prayers--especially after she catches feelings for a boy in her bio class named Aman, who her family can never know about.\n\nWith Mami's determination to force her daughter to obey the laws of the church, Xiomara understands that her thoughts are best kept to herself. So when she is invited to join her school's slam poetry club, she doesn't know how she could ever attend without her mami finding out. But she still can't stop thinking about performing her poems.",
    "img": "The Poet X.webp"
  },
  {
    "id": 8,
    "Title": "Homecoming",
    "Author": "Kate Morton",
    "PublicationDate": "April 04, 2023",
    "Genre": "Historical",
    "Description": "Adelaide Hills, Christmas Eve, 1959: At the end of a scorching hot day, beside a creek on the grounds of a grand country house, a local man makes a terrible discovery. Police are called, and the small town of Tambilla becomes embroiled in one of the most baffling murder investigations in the history of South Australia.\n\nMany years later and thousands of miles away, Jess is a journalist in search of a story. Having lived and worked in London for two decades, she now finds herself unemployed and struggling to make ends meet. A phone call out of nowhere summons her back to Sydney, where her beloved grandmother Nora, who raised Jess when her mother could not, has suffered a fall and is seriously ill in the hospital.\n\nAt Nora's house, Jess discovers a true crime book chronicling a long-buried police case: the Turner Family Tragedy of 1959. It is only when Jess skims through its pages that she finds a shocking connection between her own family and this notorious event - a mystery that has never been satisfactorily resolved.\n\nAn epic story that spans generations, Homecoming asks what we would do for those we love, how we protect the lies we tell, and what it means to come home. Above all, it is an intricate and spellbinding novel from one of the finest writers working today.",
    "img": "Homecoming.jpg"
  },
  {
    "id": 9,
    "Title": "Babel Or the Necessity of Violence",
    "Author": "R. F. Kuang ",
    "PublicationDate": "August 23, 2022\n",
    "Genre": "Historical",
    "Description": "Instant #1 New York Times Bestseller from the author of The Poppy War\n\n\"Absolutely phenomenal. One of the most brilliant, razor-sharp books I've had the pleasure of reading that isn't just an alternative fantastical history, but an interrogative one; one that grabs colonial history and the Industrial Revolution, turns it over, and shakes it out.\" -- Shannon Chakraborty, bestselling author of The City of Brass\n\nFrom award-winning author R. F. Kuang comes Babel, a thematic response to The Secret History and a tonal retort to Jonathan Strange & Mr. Norrell that grapples with student revolutions, colonial resistance, and the use of language and translation as the dominating tool of the British empire.\n\nTraduttore, traditore: An act of translation is always an act of betrayal.\n\n1828. Robin Swift, orphaned by cholera in Canton, is brought to London by the mysterious Professor Lovell. There, he trains for years in Latin, Ancient Greek, and Chinese, all in preparation for the day he'll enroll in Oxford University's prestigious Royal Institute of Translation--also known as Babel.\n\nBabel is the world's center for translation and, more importantly, magic. Silver working--the art of manifesting the meaning lost in translation using enchanted silver bars--has made the British unparalleled in power, as its knowledge serves the Empire's quest for colonization.",
    "img": "Babel Or the Necessity of Violence.jpg"
  },
  {
    "id": 10,
    "Title": "Trust",
    "Author": "Hernan Diaz",
    "PublicationDate": "May 03, 2022",
    "Genre": "Historical",
    "Description": "An unparalleled novel about money, power, intimacy, and perception\nEven through the roar and effervescence of the 1920s, everyone in New York has heard of Benjamin and Helen Rask. He is a legendary Wall Street tycoon; she is the daughter of eccentric aristocrats. Together, they have risen to the very top of a world of seemingly endless wealth--all as a decade of excess and speculation draws to an end. But at what cost have they acquired their immense fortune? This is the mystery at the center of Bonds, a successful 1937 novel that all of New York seems to have read. Yet there are other versions of this tale of privilege and deceit.\nHernan Diaz's TRUST elegantly puts these competing narratives into conversation with one another--and in tension with the perspective of one woman bent on disentangling fact from fiction. The result is a novel that spans over a century and becomes more exhilarating with each new revelation.\nAt once an immersive story and a brilliant literary puzzle, TRUST engages the reader in a quest for the truth while confronting the deceptions that often live at the heart of personal relationships, the reality-warping force of capital, and the ease with which power can manipulate facts.",
    "img": "Trust.webp"
  },

  {
    "id": 11,
    "Title": "Ten Poems to Last a Lifetime",
    "Author": "Roger Housden",
    "PublicationDate": "October 26, 2004",
    "Genre": "Poetry",
    "Description": "The fourth volume in the popular series that began with Ten Poems to Change Your Life, Ten Poems to Last a Lifetime focuses on what it means to be truly human. In it, Roger Housden offers us poems on life and death, happiness, seeing ourselves in relation to the world, and, of course, the ineffable--the things that really matter when the chips are down. He describes these passionate poems as \"bread for the soul and fire for the spirit.\"\nThe poets Housden has chosen are Billy Collins, Hayden Carruth, Dorianne Laux, James Wright, Naomi Shihab Nye, and Mary Oliver from the United States, D. H. Lawrence and John Keats from England, Rainer Maria Rilke from Germany, Fleur Adcock from New Zealand, and Seng-Ts'an from sixth-century China. And yes, that adds up to eleven, not ten. Housden decided to include a bonus poem for his faithful readers in this, the final volume of the series. As before, Housden's luminous essays provide an elegant and easy passage into the sometimes daunting world of poetry, enabling readers to feel that in him they have found a trusted guide and mentor.",
    "img": "Ten Poems to Last a Lifetime.jpg"
  },
  {
    "id": 12,
    "Title": "Phenomenal Woman",
    "Author": "Maya Angelou",
    "PublicationDate": "January 17, 1995",
    "Genre": "Poetry",
    "Description": "A collection of beloved poems about women from the iconic Maya Angelou\nThese four poems, \"Phenomenal Woman,\" \"Still I Rise,\" \"Weekend Glory,\" and \"Our Grandmothers,\" are among the most remembered and acclaimed of Maya Angelou's poems. They celebrate women with a majesty that has inspired and touched the hearts of millions.\nThese memorable poems have been reset and bound in a beautiful edition--a gift to keep and to give.",
    "img": "Phenomenal Woman.jpg"
  },
  {
    "id": 13,
    "Title": "Bonfire Opera",
    "Author": "Danusha Lameris",
    "PublicationDate": "February 25, 2020\n",
    "Genre": "Poetry",
    "Description": "Poems In Praise of the Impossible, Wild World and Its Beauty\nSometimes the most compelling landscapes are the ones where worlds collide: where a desert meets the sea, a civilization, no-man's land. Here in Bonfire Opera, grief and Eros grapple in the same domain. A bullet-hole through the heart, a house full of ripe persimmons, a ghost in a garden. Coyotes cry out on the hill, and lovers find themselves kissing, \"bee-stung, drunk\" in the middle of road. Here, the dust is holy, as is the dark, unknown. These are poems that praise the impossible, wild world, finding beauty in its wake.",
    "img": "Bonfire Opera.jpg"
  },
  {
    "id": 14,
    "Title": "All the Flowers Kneeling",
    "Author": "Paul Tran",
    "PublicationDate": "February 15, 2022",
    "Genre": "Poetry",
    "Description": "Visceral and astonishing, Paul Tran's debut poetry collection All the Flowers Kneeling investigates intergenerational trauma, sexual violence, and U.S. imperialism in order to radically alter our understanding of freedom, power, and control. In poems of desire, gender, bodies, legacies, and imagined futures, Tran's poems elucidate the complex and harrowing processes of reckoning and recovery, enhanced by innovative poetic forms that mirror the nonlinear emotional and psychological experiences of trauma survivors. At once grand and intimate, commanding and deeply vulnerable, All the Flowers Kneeling revels in rediscovering and reconfiguring the self, and ultimately becomes an essential testament to the human capacity for resilience, endurance, and love.",
    "img": "All the Flowers Kneeling.webp"
  },
  {
    "id": 15,
    "Title": "Machete",
    "Author": "Tomás Q Morin",
    "PublicationDate": "October 12, 2021",
    "Genre": "Poetry",
    "Description": "\"Dios aprieta, pero no ahorca\" (\"God squeezes, but He doesn't strangle\")--the epigraph of Machete--sets the stage for a powerful poet who summons a variety of ways to endure life when there's an invisible hand at your throat. Tomás Morín hails from the coastal plains of Texas, and explores a world where identity and place shift like that ever-changing shore.\nIn these poems, culture crashes like waves and leaves behind Billie Holiday and the CIA, disco balls and Dante, the Bible and Jerry Maguire. They are long, lean, and dazzle in their telling: \"Whiteface\" is a list of instructions for people stopped by the police; \"Duct Tape\" lauds our domestic life from the point of view of the tape itself.\nOne part Groucho Marx, one part Job, Morín considers our obsession with suffering--\"the pain in which we trust\"--and finds that the best answer to our predicament is sometimes anger, sometimes laughter, but always via the keen line between them that may be the sharpest weapon we have.",
    "img": "Machete.jpg"
  },
  {
    "id": 16,
    "Title": "A Darker Shade of Magic",
    "Author": "V. E. Schwab",
    "PublicationDate": "May 16, 2023",
    "Genre": "Fantasy",
    "Description": "Kell is one of the last Antari--magicians with a rare, coveted ability to travel between parallel Londons; Red, Grey, White, and, once upon a time, Black.\nKell was raised in Arnes--Red London--and officially serves the Maresh Empire as an ambassador, traveling between the frequent bloody regime changes in White London and the court of George III in the dullest of Londons, the one without any magic left to see.\nUnofficially, Kell is a smuggler, servicing people willing to pay for even the smallest glimpses of a world they'll never see. It's a defiant hobby with dangerous consequences, which Kell is now seeing firsthand.\nAfter an exchange goes awry, Kell escapes to Grey London and runs into Delilah Bard, a cut-purse with lofty aspirations. She first robs him, then saves him from a deadly enemy, and finally forces Kell to spirit her to another world for a proper adventure.\nNow perilous magic is afoot, and treachery lurks at every turn. To save all of the worlds, they'll first need to stay alive.",
    "img": "A Darker Shade of Magic.jpg"
  },
  {
    "id": 17,
    "Title": "What Lies Beyond the Veil",
    "Author": "Harper L. Woods,  Adelaide Forrest",
    "PublicationDate": "February 22, 2022\n",
    "Genre": "Fantasy",
    "Description": "For nearly 400 years, the Veil has protected us from the Fae of Alfheimr. In their absence, our lives have shifted from decadence and sin to survival and virtue under the guidance of the New Gods. I've spent my entire life tending to the gardens next to the boundary between our worlds, drawn to the shimmering magic like a moth to the flame.\n\n\n\nThen, we died on their swords.\n\n\n\nAll of that changes the day the Veil shatters, unleashing the fae upon our world once again. The magic of faerie marks those of us they mean to take, but the Mist Guard protecting Nothrek will kill us all before they let the fae have us. There's no choice but to flee everything I've ever known, not if I want to live to see my twenty-first birthday as a free woman.\n\n\n\nNow, they'll claim what's theirs.\n\n\n\nBut before they capture me, Caelum saves me from the Wild Hunt. Fae-marked and on the run, he is able to fight back in ways I only dream of. From tentative alliance to all-consuming passion, our bond strengthens as the fae close in and evil lurks ever nearer. With my life on the line, he is everything I shouldn't dare to want and a distraction I can't afford. I can't seem to stay away, not even with something greater on the line.\n\n\n\nMy heart.\n\n\n\nAuthor's Note: This book is intended for readers who are 18 and older. It contains mature language, graphic violence, and explicit content with darker elements. This is book one in a series and ends in a cliffhanger.",
    "img": "What Lies Beyond the Veil.jpg"
  },
  {
    "id": 18,
    "Title": "Throne of Glass",
    "Author": "Sarah J. Maas",
    "PublicationDate": "February 14, 2023\n",
    "Genre": "Fantasy",
    "Description": "Lethal. Loyal. Legendary.\n\nEnter the world of Throne of Glass with the first book in the #1 bestselling series by Sarah J. Maas.\nIn a land without magic, an assassin is summoned to the castle. She has no love for the vicious king who rules from his throne of glass, but she has not come to kill him. She has come to win her freedom. If she defeats twenty-three murderers, thieves, and warriors in a competition, she will be released from prison to serve as the King's Champion.\nHer name is Celaena Sardothien.\nThe Crown Prince will provoke her. The Captain of the Guard will protect her. And a princess from a faraway country will befriend her. But something rotten dwells in the castle, and it's there to kill. When her competitors start dying mysteriously, one by one, Celaena's fight for freedom becomes a fight for survival-and a desperate quest to root out the evil before it destroys her world.\nThrilling and fierce, Throne of Glass is the first book in the #1 New York Times bestselling series that has captivated readers worldwide.",
    "img": "Throne of Glass.jpg"
  },
  {
    "id": 19,
    "Title": "Shadow and Bone",
    "Author": "Leigh Bardugo",
    "PublicationDate": "May 07, 2013",
    "Genre": "Fantasy",
    "Description": "See the Grishaverse come to life on screen with the Netflix series, Shadow and Bone -- Season 2 streaming now!\n\nDiscover the adventure that started it all and meet Alina, Mal, and the Darkling in Shadow and Bone from #1 bestselling author, Leigh Bardugo.\n\nSoldier. Summoner. Saint. Orphaned and expendable, Alina Starkov is a soldier who knows she may not survive her first trek across the Shadow Fold--a swath of unnatural darkness crawling with monsters. But when her regiment is attacked, Alina unleashes dormant magic not even she knew she possessed.\nNow Alina will enter a lavish world of royalty and intrigue as she trains with the Grisha, her country's magical military elite--and falls under the spell of their notorious leader, the Darkling. He believes Alina can summon a force capable of destroying the Shadow Fold and reuniting their war-ravaged country, but only if she can master her untamed gift.\nAs the threat to the kingdom mounts and Alina unlocks the secrets of her past, she will make a dangerous discovery that could threaten all she loves and the very future of a nation.\nWelcome to Ravka . . . a world of science and superstition where nothing is what it seems.",
    "img": "Shadow and Bone.jpg"
  },
  {
    "id": 20,
    "Title": "A Court of Thorns and Roses",
    "Author": "Sarah J. Maas",
    "PublicationDate": "June 02, 2020",
    "Genre": "Fantasy",
    "Description": "When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows about only from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled her world.\nAt least, he's not a beast all the time.\nAs she adapts to her new home, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie she's been told about the beautiful, dangerous world of the Fae. But something is not right in the faerie lands. An ancient, wicked shadow is growing, and Feyre must find a way to stop it, or doom Tamlin-and his world-forever.\nFrom bestselling author Sarah J. Maas comes a seductive, breathtaking book that blends romance, adventure, and faerie lore into an unforgettable read.",
    "img": "A Court of Thorns and Roses.webp"
  }
]



